Backend_BBDD/input/plantillaReserva.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:com="http://www.soap.servicios.hospedajes.mir.es/comunicacion">
    <soapenv:Header/>
    <soapenv:Body>
        <com:comunicacionRequest>
            <peticion>
                <cabecera>
                    <codigoArrendador></codigoArrendador>
                    <aplicacion>APP_Pruebas</aplicacion>
                    <tipoOperacion>A</tipoOperacion>
                    <tipoComunicacion>RH</tipoComunicacion>
                </cabecera>
                <solicitud></solicitud>
            </peticion>
        </com:comunicacionRequest>
    </soapenv:Body>
</soapenv:Envelope>
